packages/core/src/external/saml/__tests__/valid-saml.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To mustUnderstand="1">http://localhost:9091/Gateway/PatientDiscovery/1_0/NhinService/NhinPatientDiscovery</wsa:To><wsa:Action mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201305UV02:CrossGatewayPatientDiscovery</wsa:Action><wsa:MessageID>urn:uuid:3dc15e09-bfc5-4065-8715-74346d8b30b6</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address></wsa:ReplyTo><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:hl7="urn:hl7-org:v3" xmlns:xs="http://www.w3.org/2001/XMLSchema"><saml2:Assertion ID="TS_3e57269d-075d-4d3f-9f5d-c97ad6afc009" IssueInstant="2024-04-09T18:19:22.811Z" Version="2.0"><saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">support@metriport.com</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#TS_3e57269d-075d-4d3f-9f5d-c97ad6afc009"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>gpPjeFRDo3cQOCqBzcqkPnPfTb4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>XL+isQgTow+7yX7GxPkILdMrN6+aXikr8N+VwQYeS/9vbTgnzSbF5Py/lHbQKRxgZH07fnBc+UXaODiuiAjF1ewW19f/OsGruCvwvQCFdOfGCre4mvIp67nHc7Oj/t97v+3wc1VfOBdXTmVaXgwG/51ISUWSAHDTSM7pJDhxKhQ=</ds:SignatureValue></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=ihe.staging.metriport.com,OU=CAREQUALITY,O=MetriportInc.,ST=California,C=US</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key"><saml2:SubjectConfirmationData><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>vi+mgfcfdvJ6GOPtEAbF58ZEBOKriZe3Nz1D3Vbu5PQNNoURuPNVyH1oaw2OYuzhAeyhlu6hSaLSy3jHnP1JClMAoL91bya7NpxPcTt0kliHTcwA7pGIfgsbfhVFOrVJA3qoO3asIrzl4bjk0cjiNx6m1k27pmi3XPI7n89i4Wk=</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue><ds:X509Data><ds:X509Certificate>MIIBxDCCAW6gAwIBAgIQxUSXFzWJYYtOZnmmuOMKkjANBgkqhkiG9w0BAQQFADAWMRQwEgYDVQQDEwtSb290IEFnZW5jeTAeFw0wMzA3MDgxODQ3NTlaFw0zOTEyMzEyMzU5NTlaMB8xHTAbBgNVBAMTFFdTRTJRdWlja1N0YXJ0Q2xpZW50MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC+L6aB9x928noY4+0QBsXnxkQE4quJl7c3PUPdVu7k9A02hRG481XIfWhrDY5i7OEB7KGW7qFJotLLeMec/UkKUwCgv3VvJrs2nE9xO3SSWIdNzADukYh+Cxt+FUU6tUkDeqg7dqwivOXhuOTRyOI3HqbWTbumaLdc8jufz2LhaQIDAQABo0swSTBHBgNVHQEEQDA+gBAS5AktBh0dTwCNYSHcFmRjoRgwFjEUMBIGA1UEAxMLUm9vdCBBZ2VuY3mCEAY3bACqAGSKEc+41KpcNfQwDQYJKoZIhvcNAQEEBQADQQAfIbnMPVYkNNfX1tG1F+qfLhHwJdfDUZuPyRPucWF5qkh6sSdWVBY5sT/txBnVJGziyO8DPYdu2fPMER8ajJfl</ds:X509Certificate></ds:X509Data></ds:KeyInfo></saml2:SubjectConfirmationData></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2024-04-09T18:19:22.811Z" NotOnOrAfter="2024-04-09T19:19:22.811Z"><saml2:AudienceRestriction><saml2:Audience>http://localhost:9091/Gateway/PatientDiscovery/1_0/NhinService/NhinPatientDiscovery</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2024-04-09T18:19:22.811Z"><saml2:SubjectLocality Address="127.0.0.1" DNSName="localhost"/><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue>Administrative AND/OR managerial worker</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue>Metriport</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue>1.16.840.1.113883.3.9621.5.219</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue>1.16.840.1.113883.3.9621.5.219</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="hl7:CE"><hl7:Role xsi:type="hl7:CE" code="106331006" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Administrative AND/OR managerial worker"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="hl7:CE"><hl7:PurposeOfUse code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment"/></saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion><wsu:Timestamp wsu:Id="TS-7c229e85-d62b-471e-9112-a49d1c365004"><wsu:Created>2024-04-09T18:19:22.811Z</wsu:Created><wsu:Expires>2024-04-09T19:19:22.811Z</wsu:Expires></wsu:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#TS-7c229e85-d62b-471e-9112-a49d1c365004"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>yjuRU7pJdZlNp+ktypigFrwRadc=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>QijlVcpw8QBOVCJbROVQ2Ib9RZRo4u2Qv+4AUSM2IlipQq8eviXtcciMgaBN3q6B1J/1pmQUzRNjE733Tam2bp2dBSBti/crj86lT+pce6rA1HqGhTJFtT2lmOpV0tfitfXggfLVpBRvTYB7XK7qDEUIVGCCIq4A/CHBV/aFWx0=</ds:SignatureValue></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:urn="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"><urn:PRPA_IN201305UV02 ITSVersion="XML_1.0"><urn:id extension="urn:uuid:3dc15e09-bfc5-4065-8715-74346d8b30b6" root="1.16.840.1.113883.3.9621.5.219"/><urn:creationTime value="2024-04-09T18:19:22.811Z"/><urn:interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/><urn:processingCode code="P"/><urn:processingModeCode code="T"/><urn:acceptAckCode code="AL"/><urn:receiver typeCode="RCV"><urn:device classCode="DEV" determinerCode="INSTANCE"><urn:id root="2.16.840.1.113883.3.9801.2.1"/><urn:telecom value="http://localhost:9091/Gateway/PatientDiscovery/1_0/NhinService/NhinPatientDiscovery"/><urn:asAgent classCode="AGNT"><urn:representedOrganization classCode="ORG" determinerCode="INSTANCE"><urn:id root="2.16.840.1.113883.3.9801.2.1"/></urn:representedOrganization></urn:asAgent></urn:device></urn:receiver><urn:sender typeCode="SND"><urn:device classCode="DEV" determinerCode="INSTANCE"><urn:id root="2.16.840.1.113883.3.9621"/><urn:asAgent classCode="AGNT"><urn:representedOrganization classCode="ORG" determinerCode="INSTANCE"><urn:id root="2.16.840.1.113883.3.9621"/><urn:name>Metriport</urn:name></urn:representedOrganization></urn:asAgent></urn:device></urn:sender><urn:controlActProcess classCode="CACT" moodCode="EVN"><urn:code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/><urn:queryByParameter><urn:queryId extension="urn:uuid:3dc15e09-bfc5-4065-8715-74346d8b30b6" root="1.16.840.1.113883.3.9621.5.219"/><urn:statusCode code="new"/><urn:responseModalityCode code="R"/><urn:responsePriorityCode code="I"/><urn:parameterList><urn:livingSubjectAdministrativeGender><urn:value code="M" codeSystem="2.16.840.1.113883.5.1"/><urn:semanticsText>LivingSubject.administrativeGender</urn:semanticsText></urn:livingSubjectAdministrativeGender><urn:livingSubjectBirthTime><urn:value value="19810101"/><urn:semanticsText>LivingSubject.birthTime</urn:semanticsText></urn:livingSubjectBirthTime><urn:livingSubjectName><urn:value><urn:family>Obama</urn:family><urn:given>Barack</urn:given></urn:value><urn:semanticsText>LivingSubject.name</urn:semanticsText></urn:livingSubjectName><urn:patientAddress><urn:value><urn:streetAddressLine>1600 Pennsylvania Avenue NW</urn:streetAddressLine><urn:city>Washington</urn:city><urn:state>DC</urn:state><urn:postalCode>20500</urn:postalCode><urn:country>USA</urn:country></urn:value><urn:semanticsText>Patient.addr</urn:semanticsText></urn:patientAddress><urn:patientTelecom/><urn:principalCareProviderId><urn:value extension="1234567890" root="2.16.840.1.113883.4.6"/></urn:principalCareProviderId></urn:parameterList></urn:queryByParameter></urn:controlActProcess></urn:PRPA_IN201305UV02></soap:Body></soap:Envelope>